app/controllers/comments_controller.rb

INSERT INTO `comments` (`text`, `created_at`, `updated_at`, `user_id`, `prototype_id`) VALUES ('最高', '2021-02-11 18:33:20.501583', '2021-02-11 18:33:20.501583', 1, 2)
---
  def create
    @comment = Comment.new(comment_params)
     if @comment.save