app/controllers/prototypes_controller.rb

SELECT `prototypes`.* FROM `prototypes`
---
  def index
    @prototypes = Prototype.includes(:user)

INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('aaaaa124', 'aaaaaa', 'aaaaaaaa', 1, '2021-02-11 18:21:57.370025', '2021-02-11 18:21:57.370025')
---
  def create
    @prototype = Prototype.new(prototype_params)
    if @prototype.save

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
---
  def show
    @prototype = Prototype.find(params[:id])

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
---
  def edit
    @prototype = Prototype.find(params[:id])

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`title` = 'aaaaa123', `prototypes`.`updated_at` = '2021-02-08 19:03:20.506657' WHERE `prototypes`.`id` = 1
---
  def update
    @prototype = Prototype.find(params[:id])
    if @prototype.update(prototype_params)

SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 1
---
  def destroy
    @prototype = Prototype.find(params[:id])
    @prototype.destroy